$(function(){
  var database = {
        'beimei':{
          "斯托夫人":"汤姆叔叔的小屋",
          "惠特曼":"草叶集",
          "麦尔维尔":"白鲸",
          "马克吐温":"汤姆·索亚历险记",
          "欧亨利":"麦琪的礼物",
          "杰克伦敦":"马丁·伊登",
          "海明威":"老人与海",
          "赛珍珠":"大地",
          "马格丽特米切尔":"飘",
          "艾丽斯·门罗":"逃离",
          "霍桑":"红字"
        },
        "nanmei":{
          "保罗柯艾略":"牧羊少年奇幻之旅",
          "马里奥德安德拉德":"马库奈伊玛",
          "博尔赫斯":"布宜诺斯艾利斯的激情",
          "科塔萨尔":"跳房子",
          "普伊格":"蜘蛛女之吻",
          "安东尼奥·斯卡尔梅达":"瓦房顶上的裸体人",
          "加西亚·马尔克斯":"百年孤独",
          "略萨":"城市与狗",
        },
        "feizhou":{
          "艾伯特·约翰·卢图利":"解放我的人民",
          "纳丁戈迪默":"七月的人民",
          "沃莱索因卡":"雄狮与宝石",
          "莉拉阿鲍蕾拉":"歌词巷",
          "马赫福兹 ":"尼罗河上的船家",
          "迈哈福兹":"平民史诗",
          "奇玛曼达·恩戈奇·阿迪契":"紫色木槿",
          "埃及人民":"无言的金字塔",
        },
        "ouzhou":{
          "奥维德":"变形记",
          "乔叟":"坎特伯雷故事集",
          "托马斯莫尔":"乌托邦",
          "莎士比亚":"哈姆莱特",
          "弥尔顿":"失乐园",
          "笛福":"鲁宾逊漂流记",
          "斯威夫特":"格列弗游记",
          "雪莱":"西风颂",
          "济慈":"夜莺颂",
          "拜伦":"唐璜",
          "简奥斯丁":"傲慢与偏见",
          "狄更斯":"双城记",
          "戈尔丁":"蝇王",
          "拉伯雷":"巨人传",
          "拉封丹":"寓言诗",
          "伏尔泰":"老实人",
          "卢梭":"爱弥儿",
          "雨果":"巴黎圣母院",
          "大仲马":"基督山伯爵",
          "小仲马":"茶花女",
          "莫泊桑":"羊脂球",
          "罗曼罗兰":"约翰。克里斯朵夫",
          "塞尔普鲁斯特":"追忆似水年华",
          "詹姆斯。乔伊斯":"尤利西斯",
          "贝克特":"等待戈多",
          "但丁":"神曲",
          "薄伽丘":"十日谈",
          "塞万提斯":"堂吉诃德",
          "歌德":"浮士德",
          "普希金":"叶浦盖尼.奥涅金",
          "福楼拜":"包法利夫人",
          "果戈理":"死魂灵",
          "肖洛霍夫":"静静的顿河",
          "高尔基":"童年",
          "显克微支":"十字军骑士",
          "安徒生":"人鱼公主",
          "易卜生":"玩偶之家",
          "斯蒂芬.茨威格":"象棋的故事",
          "卡夫卡":"城堡"
        },
        "yazhou":{
          "曹雪芹":"红楼梦",
          "罗贯中":"三国演义",
          "吴承恩":"西游记",
          "施耐恩":"水浒传",
          "老子":"逍遥游",
          "孔子":"论语",
          "王阳明":"王阳明文集",
          "曹植":"洛水赋",
          "司马迁":"史记",
          "周文王":"易经",
          "苏轼":"赤壁赋",
          "莫言":"丰乳肥臀",
          "屈原":"离骚",
          "司马迁":"史记",
          "李白":"将进酒",
          "关汉卿":"窦娥冤",
          "艾特马托夫":"一日长于百年",
          "奈保尔":"大河弯",
          "泰戈尔":"飞鸟集",
          "川端康成 ":"雪国",
          "紫式部":"源氏物语",
          "印度史诗":"罗摩衍那",
          "吉卜林":"丛林之书",
          "村上春树 ":"音乐之旅"
        },
        "dayang":{
          "帕特利克怀特":"人类之树",
          "考琳麦卡洛":"荆棘鸟",
          "约瑟夫弗尔菲":"如此人生",
          "亨利汉德尔理查逊":"马奥尼的命运",
          "托马斯亚历山大布朗":"武装抢劫",
          "诺埃尔希利亚德 ":"毛利妇女",
          "伊恩克罗斯":"上帝的孩子",
          "弗兰克萨吉森":"一个男人和他的妻子",
          "琼德万尼":"肉店",
          "詹姆斯亨利":"玛尔西利娜",
        }
      }

  var colors = ['#bbcbb8','#b5d3ed','#f7d5ca','rgba(173, 145, 196, 0.88)','#eef0ec','#baf3c1'];
  var colorsForState = {};
  $('area').each(function(i){
    colorsForState[this.id] = colors[i];
  });

  $('area').click(function(){
    $('.tanchu').css('background-color',colorsForState[this.id]);
    $('.tanchu').slideToggle(500);
    $('.list').empty();
    var content = '';
    for (var n in database){
      if (n == this.id) {
        for(var t in database[n]){
            content = content + '<li class="list-item">\
                        <div class="left">\
                        <img class="people" src="./pic/'+t+'.jpg"  onerror="javascript:this.src=\'./pic/1.jpg\';">\
                        </div>\
                        <div class="right">\
                        '+ t +'\
                        </div>\
                        <div class="r-right">\
                        '+ database[n][t]+'\
                        </div>\
                        </li>';
        }
      }
    }
    $('.list').html(content);
  })

  $('#img').click(function(){
    $('.tanchu').slideUp(500);
  })


})
